SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_rcc.h
/***********************************************************************************************************************
    @file     reg_rcc.h
    @author   VV TEAM
    @brief    This flie contains all the RCC's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_RCC_H
#define __REG_RCC_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include <core_cm0plus.h>



/**
  * @brief RCC Base Address Definition
  */
#define  RCC_BASE                                  0x40021000                                       /*!<Base Address: 0x40021000*/

/**
  * @brief RCC Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR;                             /*!<RCC Clock Control Register                     offset: 0x00       */
    __IO uint32_t CFGR;                           /*!<RCC Clock Configuration Register               offset: 0x04       */
    __IO uint32_t CIR;                            /*!<RCC Clock Interrupt Register                   offset: 0x08       */
    __IO uint32_t APB2RSTR;                       /*!<RCC APB2 Peripheral Reset Register             offset: 0x0C       */
    __IO uint32_t APB1RSTR;                       /*!<RCC APB1 Peripheral Reset Register             offset: 0x10       */
    __IO uint32_t AHBENR;                         /*!<RCC AHB Peripheral Clock Enable Register       offset: 0x14       */
    __IO uint32_t APB2ENR;                        /*!<RCC APB2 Peripheral Clock Enable Register      offset: 0x18       */
    __IO uint32_t APB1ENR;                        /*!<RCC APB1Peripheral Clock Enable Register       offset: 0x1C       */
    __IO uint32_t BDCR;                           /*!<RCC Backup Domain Control Register             offset: 0x20       */
    __IO uint32_t CSR;                            /*!<RCC Control Status Register                    offset: 0x24       */
    __IO uint32_t AHBRSTR;                        /*!<RCC AHB Peripheral Reset Register              offset: 0x28       */
    __IO uint32_t CFGR2;                          /*!<RCC Clock Configuration Register 2             offset: 0x2C       */
    __IO uint32_t RESERVED0x30[4];                /*!<                                               offset: 0x30~0x3C  */
    __IO uint32_t SYSCFG;                         /*!<RCC System Configuration Register              offset: 0x40       */
    __IO uint32_t HSIDLY;                         /*!<RCC HSI clock delay register                   offset: 0x44       */
    __IO uint32_t HSEDLY;                         /*!<RCC HSE clock delay register                   offset: 0x48       */
    __IO uint32_t ICSCR;                          /*!<RCC Internal clock source calibration          offset: 0x4C
                                                      register                                                          */
    __IO uint32_t RESERVED0x50[1];                /*!<                                               offset: 0x50       */
    __IO uint32_t FRVSCR;                         /*!<RCC Reference voltage calibration register     offset: 0x54       */
    __IO uint32_t RESERVED0x58[2];                /*!<                                               offset: 0x58~0x5C  */
    __IO uint32_t LSCCR;                          /*!<RCC Low Speed Clock Control Register           offset: 0x60       */
    __IO uint32_t RESERVED0x64[7];                /*!<                                               offset: 0x64~0x7C  */
    __IO uint32_t LDOCR;                          /*!<RCC LDO configuration register                 offset: 0x80       */
} RCC_TypeDef;

/**
  * @brief RCC type pointer Definition
  */
#define RCC                                       ((RCC_TypeDef *)RCC_BASE)

/**
  * @brief RCC_CR Register Bit Definition
  */
#define  RCC_CR_HSION_Pos                         (0)
#define  RCC_CR_HSION_Msk                         (0x1U << RCC_CR_HSION_Pos)                        /*!<Internal High-speed Clock Enable*/
#define  RCC_CR_HSION                             RCC_CR_HSION_Msk
#define  RCC_CR_HSIRDY_Pos                        (1)
#define  RCC_CR_HSIRDY_Msk                        (0x1U << RCC_CR_HSIRDY_Pos)                       /*!<Internal High-speed Clock Ready Flag*/
#define  RCC_CR_HSIRDY                            RCC_CR_HSIRDY_Msk
#define  RCC_CR_DEGLITCHBYP_Pos                   (6)
#define  RCC_CR_DEGLITCHBYP_Msk                   (0x1U << RCC_CR_DEGLITCHBYP_Pos)                  /*!<Deburring Circuit Bypass Control Bit*/
#define  RCC_CR_DEGLITCHBYP                       RCC_CR_DEGLITCHBYP_Msk
#define  RCC_CR_DEGLITCHSEL_Pos                   (7)
#define  RCC_CR_DEGLITCHSEL_Msk                   (0x1U << RCC_CR_DEGLITCHSEL_Pos)                  /*!<Deburring Width Control Bit*/
#define  RCC_CR_DEGLITCHSEL                       RCC_CR_DEGLITCHSEL_Msk
#define  RCC_CR_HSEOUTPUTSEL_Pos                  (8)
#define  RCC_CR_HSEOUTPUTSEL_Msk                  (0x1U << RCC_CR_HSEOUTPUTSEL_Pos)                 /*!<Output Mode Selector*/
#define  RCC_CR_HSEOUTPUTSEL                      RCC_CR_HSEOUTPUTSEL_Msk
#define  RCC_CR_HSIDIV_Pos                        (11)
#define  RCC_CR_HSIDIV_Msk                        (0xFU << RCC_CR_HSIDIV_Pos)                       /*!<Internal high-speed clock division factor*/
#define  RCC_CR_HSIDIV                            RCC_CR_HSIDIV_Msk
#define  RCC_CR_HSIDIV_0                          (0x1U << RCC_CR_HSIDIV_Pos) 
#define  RCC_CR_HSIDIV_1                          (0x2U << RCC_CR_HSIDIV_Pos) 
#define  RCC_CR_HSIDIV_2                          (0x4U << RCC_CR_HSIDIV_Pos) 
#define  RCC_CR_HSIDIV_3                          (0x8U << RCC_CR_HSIDIV_Pos) 
#define  RCC_CR_HSEON_Pos                         (16)
#define  RCC_CR_HSEON_Msk                         (0x1U << RCC_CR_HSEON_Pos)                        /*!<External High-speed Clock Enable*/
#define  RCC_CR_HSEON                             RCC_CR_HSEON_Msk
#define  RCC_CR_HSERDY_Pos                        (17)
#define  RCC_CR_HSERDY_Msk                        (0x1U << RCC_CR_HSERDY_Pos)                       /*!<External High-speed Clock Ready Flag*/
#define  RCC_CR_HSERDY                            RCC_CR_HSERDY_Msk
#define  RCC_CR_HSEBYP_Pos                        (18)
#define  RCC_CR_HSEBYP_Msk                        (0x1U << RCC_CR_HSEBYP_Pos)                       /*!<External High-speed Clock Bypass*/
#define  RCC_CR_HSEBYP                            RCC_CR_HSEBYP_Msk
#define  RCC_CR_CSSHSON_Pos                       (19)
#define  RCC_CR_CSSHSON_Msk                       (0x1U << RCC_CR_CSSHSON_Pos)                      /*!<Clock Security System HSE High Souce Enable*/
#define  RCC_CR_CSSHSON                           RCC_CR_CSSHSON_Msk
#define  RCC_CR_CSSLSON_Pos                       (20)
#define  RCC_CR_CSSLSON_Msk                       (0x1U << RCC_CR_CSSLSON_Pos)                      /*!<Clock Security System Low Souce Enable*/
#define  RCC_CR_CSSLSON                           RCC_CR_CSSLSON_Msk
#define  RCC_CR_FLEN_Pos                          (31)
#define  RCC_CR_FLEN_Msk                          (0x1U << RCC_CR_FLEN_Pos)                         /*!<Frass Lip mode clock enabled*/
#define  RCC_CR_FLEN                              RCC_CR_FLEN_Msk

/**
  * @brief RCC_CFGR Register Bit Definition
  */
#define  RCC_CFGR_SW_Pos                          (0)
#define  RCC_CFGR_SW_Msk                          (0x3U << RCC_CFGR_SW_Pos)                         /*!<System Clock Switch*/
#define  RCC_CFGR_SW                              RCC_CFGR_SW_Msk
#define  RCC_CFGR_SW_0                            (0x1U << RCC_CFGR_SW_Pos) 
#define  RCC_CFGR_SW_1                            (0x2U << RCC_CFGR_SW_Pos) 
#define  RCC_CFGR_SWS_Pos                         (2)
#define  RCC_CFGR_SWS_Msk                         (0x3U << RCC_CFGR_SWS_Pos)                        /*!<System Clock Switch Status*/
#define  RCC_CFGR_SWS                             RCC_CFGR_SWS_Msk
#define  RCC_CFGR_SWS_0                           (0x1U << RCC_CFGR_SWS_Pos) 
#define  RCC_CFGR_SWS_1                           (0x2U << RCC_CFGR_SWS_Pos) 
#define  RCC_CFGR_HPRE_Pos                        (4)
#define  RCC_CFGR_HPRE_Msk                        (0xFU << RCC_CFGR_HPRE_Pos)                       /*!<AHB prescaler coefficient*/
#define  RCC_CFGR_HPRE                            RCC_CFGR_HPRE_Msk
#define  RCC_CFGR_HPRE_0                          (0x1U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_HPRE_1                          (0x2U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_HPRE_2                          (0x4U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_HPRE_3                          (0x8U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_PPRE1_Pos                       (8)
#define  RCC_CFGR_PPRE1_Msk                       (0x7U << RCC_CFGR_PPRE1_Pos)                      /*!<APB1 prescaler coefficient*/
#define  RCC_CFGR_PPRE1                           RCC_CFGR_PPRE1_Msk
#define  RCC_CFGR_PPRE1_0                         (0x1U << RCC_CFGR_PPRE1_Pos) 
#define  RCC_CFGR_PPRE1_1                         (0x2U << RCC_CFGR_PPRE1_Pos) 
#define  RCC_CFGR_PPRE1_2                         (0x4U << RCC_CFGR_PPRE1_Pos) 
#define  RCC_CFGR_PPRE2_Pos                       (11)
#define  RCC_CFGR_PPRE2_Msk                       (0x7U << RCC_CFGR_PPRE2_Pos)                      /*!<APB2 prescaler coefficient*/
#define  RCC_CFGR_PPRE2                           RCC_CFGR_PPRE2_Msk
#define  RCC_CFGR_PPRE2_0                         (0x1U << RCC_CFGR_PPRE2_Pos) 
#define  RCC_CFGR_PPRE2_1                         (0x2U << RCC_CFGR_PPRE2_Pos) 
#define  RCC_CFGR_PPRE2_2                         (0x4U << RCC_CFGR_PPRE2_Pos) 
#define  RCC_CFGR_CK_OFF_Pos                      (14)
#define  RCC_CFGR_CK_OFF_Msk                      (0x1U << RCC_CFGR_CK_OFF_Pos)                     /*!<In STOP mode, the clock turns off the control bit*/
#define  RCC_CFGR_CK_OFF                          RCC_CFGR_CK_OFF_Msk
#define  RCC_CFGR_MCO_Pos                         (24)
#define  RCC_CFGR_MCO_Msk                         (0x7U << RCC_CFGR_MCO_Pos)                        /*!<Micro Controller Clock Output*/
#define  RCC_CFGR_MCO                             RCC_CFGR_MCO_Msk
#define  RCC_CFGR_MCO_0                           (0x1U << RCC_CFGR_MCO_Pos) 
#define  RCC_CFGR_MCO_1                           (0x2U << RCC_CFGR_MCO_Pos) 
#define  RCC_CFGR_MCO_2                           (0x4U << RCC_CFGR_MCO_Pos) 

/**
  * @brief RCC_CIR Register Bit Definition
  */
#define  RCC_CIR_LSIRDYF_Pos                      (0)
#define  RCC_CIR_LSIRDYF_Msk                      (0x1U << RCC_CIR_LSIRDYF_Pos)                     /*!<LSI Ready Interrupt Flag*/
#define  RCC_CIR_LSIRDYF                          RCC_CIR_LSIRDYF_Msk
#define  RCC_CIR_LSERDYF_Pos                      (1)
#define  RCC_CIR_LSERDYF_Msk                      (0x1U << RCC_CIR_LSERDYF_Pos)                     /*!<LSERDYF: LSE Ready Interrupt Flag*/
#define  RCC_CIR_LSERDYF                          RCC_CIR_LSERDYF_Msk
#define  RCC_CIR_HSIRDYF_Pos                      (2)
#define  RCC_CIR_HSIRDYF_Msk                      (0x1U << RCC_CIR_HSIRDYF_Pos)                     /*!<HSI Ready Interrupt Flag*/
#define  RCC_CIR_HSIRDYF                          RCC_CIR_HSIRDYF_Msk
#define  RCC_CIR_HSERDYF_Pos                      (3)
#define  RCC_CIR_HSERDYF_Msk                      (0x1U << RCC_CIR_HSERDYF_Pos)                     /*!<HSE Ready Interrupt Flag*/
#define  RCC_CIR_HSERDYF                          RCC_CIR_HSERDYF_Msk
#define  RCC_CIR_CSSLSF_Pos                       (6)
#define  RCC_CIR_CSSLSF_Msk                       (0x1U << RCC_CIR_CSSLSF_Pos)                      /*!<Clock Security System Low Source Interrupt Flag*/
#define  RCC_CIR_CSSLSF                           RCC_CIR_CSSLSF_Msk
#define  RCC_CIR_CSSHSF_Pos                       (7)
#define  RCC_CIR_CSSHSF_Msk                       (0x1U << RCC_CIR_CSSHSF_Pos)                      /*!<Clock Security System High Source Interrupt Flag*/
#define  RCC_CIR_CSSHSF                           RCC_CIR_CSSHSF_Msk
#define  RCC_CIR_LSIRDYIE_Pos                     (8)
#define  RCC_CIR_LSIRDYIE_Msk                     (0x1U << RCC_CIR_LSIRDYIE_Pos)                    /*!<LSI Ready Interrupt Enable*/
#define  RCC_CIR_LSIRDYIE                         RCC_CIR_LSIRDYIE_Msk
#define  RCC_CIR_LSERDYIE_Pos                     (9)
#define  RCC_CIR_LSERDYIE_Msk                     (0x1U << RCC_CIR_LSERDYIE_Pos)                    /*!<LSERDYIE: LSE Ready Interrupt Enable*/
#define  RCC_CIR_LSERDYIE                         RCC_CIR_LSERDYIE_Msk
#define  RCC_CIR_HSIRDYIE_Pos                     (10)
#define  RCC_CIR_HSIRDYIE_Msk                     (0x1U << RCC_CIR_HSIRDYIE_Pos)                    /*!<HSI Ready Interrupt Enable*/
#define  RCC_CIR_HSIRDYIE                         RCC_CIR_HSIRDYIE_Msk
#define  RCC_CIR_HSERDYIE_Pos                     (11)
#define  RCC_CIR_HSERDYIE_Msk                     (0x1U << RCC_CIR_HSERDYIE_Pos)                    /*!<HSE Ready Interrupt Enable*/
#define  RCC_CIR_HSERDYIE                         RCC_CIR_HSERDYIE_Msk
#define  RCC_CIR_LSIRDYC_Pos                      (16)
#define  RCC_CIR_LSIRDYC_Msk                      (0x1U << RCC_CIR_LSIRDYC_Pos)                     /*!<LSI Ready Interrupt Clear*/
#define  RCC_CIR_LSIRDYC                          RCC_CIR_LSIRDYC_Msk
#define  RCC_CIR_LSERDYC_Pos                      (17)
#define  RCC_CIR_LSERDYC_Msk                      (0x1U << RCC_CIR_LSERDYC_Pos)                     /*!<LSERDYC: LSE Ready Interrupt Clear*/
#define  RCC_CIR_LSERDYC                          RCC_CIR_LSERDYC_Msk
#define  RCC_CIR_HSIRDYC_Pos                      (18)
#define  RCC_CIR_HSIRDYC_Msk                      (0x1U << RCC_CIR_HSIRDYC_Pos)                     /*!<HSI Ready Interrupt Clear*/
#define  RCC_CIR_HSIRDYC                          RCC_CIR_HSIRDYC_Msk
#define  RCC_CIR_HSERDYC_Pos                      (19)
#define  RCC_CIR_HSERDYC_Msk                      (0x1U << RCC_CIR_HSERDYC_Pos)                     /*!<HSE Ready Interrupt Clear*/
#define  RCC_CIR_HSERDYC                          RCC_CIR_HSERDYC_Msk
#define  RCC_CIR_CSSLSC_Pos                       (22)
#define  RCC_CIR_CSSLSC_Msk                       (0x1U << RCC_CIR_CSSLSC_Pos)                      /*!<Clock Security System Low Source Interrupt Clear*/
#define  RCC_CIR_CSSLSC                           RCC_CIR_CSSLSC_Msk
#define  RCC_CIR_CSSHSC_Pos                       (23)
#define  RCC_CIR_CSSHSC_Msk                       (0x1U << RCC_CIR_CSSHSC_Pos)                      /*!<Clock Security System High Source Interrupt Clear*/
#define  RCC_CIR_CSSHSC                           RCC_CIR_CSSHSC_Msk

/**
  * @brief RCC_APB2RSTR Register Bit Definition
  */
#define  RCC_APB2RSTR_SYSCFG_Pos                  (0)
#define  RCC_APB2RSTR_SYSCFG_Msk                  (0x1U << RCC_APB2RSTR_SYSCFG_Pos)                 /*!<SYSCFG Reset*/
#define  RCC_APB2RSTR_SYSCFG                      RCC_APB2RSTR_SYSCFG_Msk
#define  RCC_APB2RSTR_AES_Pos                     (1)
#define  RCC_APB2RSTR_AES_Msk                     (0x1U << RCC_APB2RSTR_AES_Pos)                    /*!<AESRST Reset*/
#define  RCC_APB2RSTR_AES                         RCC_APB2RSTR_AES_Msk
#define  RCC_APB2RSTR_TRNG_Pos                    (2)
#define  RCC_APB2RSTR_TRNG_Msk                    (0x1U << RCC_APB2RSTR_TRNG_Pos)                   /*!<TRNGRST Reset*/
#define  RCC_APB2RSTR_TRNG                        RCC_APB2RSTR_TRNG_Msk
#define  RCC_APB2RSTR_ADC_Pos                     (9)
#define  RCC_APB2RSTR_ADC_Msk                     (0x1U << RCC_APB2RSTR_ADC_Pos)                    /*!<ADC Reset*/
#define  RCC_APB2RSTR_ADC                         RCC_APB2RSTR_ADC_Msk
#define  RCC_APB2RSTR_SPI1_Pos                    (12)
#define  RCC_APB2RSTR_SPI1_Msk                    (0x1U << RCC_APB2RSTR_SPI1_Pos)                   /*!<SPI1 Reset*/
#define  RCC_APB2RSTR_SPI1                        RCC_APB2RSTR_SPI1_Msk
#define  RCC_APB2RSTR_USART1_Pos                  (14)
#define  RCC_APB2RSTR_USART1_Msk                  (0x1U << RCC_APB2RSTR_USART1_Pos)                 /*!<USART1 Reset*/
#define  RCC_APB2RSTR_USART1                      RCC_APB2RSTR_USART1_Msk
#define  RCC_APB2RSTR_COMP_Pos                    (15)
#define  RCC_APB2RSTR_COMP_Msk                    (0x1U << RCC_APB2RSTR_COMP_Pos)                   /*!<Comparator reset*/
#define  RCC_APB2RSTR_COMP                        RCC_APB2RSTR_COMP_Msk
#define  RCC_APB2RSTR_TIM16_Pos                   (17)
#define  RCC_APB2RSTR_TIM16_Msk                   (0x1U << RCC_APB2RSTR_TIM16_Pos)                  /*!<TIM16 Reset*/
#define  RCC_APB2RSTR_TIM16                       RCC_APB2RSTR_TIM16_Msk
#define  RCC_APB2RSTR_TIM17_Pos                   (18)
#define  RCC_APB2RSTR_TIM17_Msk                   (0x1U << RCC_APB2RSTR_TIM17_Pos)                  /*!<TIM17 Reset*/
#define  RCC_APB2RSTR_TIM17                       RCC_APB2RSTR_TIM17_Msk
#define  RCC_APB2RSTR_LPTIM2_Pos                  (19)
#define  RCC_APB2RSTR_LPTIM2_Msk                  (0x1U << RCC_APB2RSTR_LPTIM2_Pos)                 /*!<LPTIM2 reset*/
#define  RCC_APB2RSTR_LPTIM2                      RCC_APB2RSTR_LPTIM2_Msk
#define  RCC_APB2RSTR_DBG_Pos                     (22)
#define  RCC_APB2RSTR_DBG_Msk                     (0x1U << RCC_APB2RSTR_DBG_Pos)                    /*!<DBGMCU Reset*/
#define  RCC_APB2RSTR_DBG                         RCC_APB2RSTR_DBG_Msk
#define  RCC_APB2RSTR_LPUART2_Pos                 (23)
#define  RCC_APB2RSTR_LPUART2_Msk                 (0x1U << RCC_APB2RSTR_LPUART2_Pos)                /*!<LPUART2 reset*/
#define  RCC_APB2RSTR_LPUART2                     RCC_APB2RSTR_LPUART2_Msk
#define  RCC_APB2RSTR_LPTIM1_Pos                  (30)
#define  RCC_APB2RSTR_LPTIM1_Msk                  (0x1U << RCC_APB2RSTR_LPTIM1_Pos)                 /*!<LPTIM1 reset*/
#define  RCC_APB2RSTR_LPTIM1                      RCC_APB2RSTR_LPTIM1_Msk
#define  RCC_APB2RSTR_LPUART1_Pos                 (31)
#define  RCC_APB2RSTR_LPUART1_Msk                 (0x1U << RCC_APB2RSTR_LPUART1_Pos)                /*!<LPUART1 reset*/
#define  RCC_APB2RSTR_LPUART1                     RCC_APB2RSTR_LPUART1_Msk

/**
  * @brief RCC_APB1RSTR Register Bit Definition
  */
#define  RCC_APB1RSTR_TIM3_Pos                    (1)
#define  RCC_APB1RSTR_TIM3_Msk                    (0x1U << RCC_APB1RSTR_TIM3_Pos)                   /*!<TIM3 Reset*/
#define  RCC_APB1RSTR_TIM3                        RCC_APB1RSTR_TIM3_Msk
#define  RCC_APB1RSTR_TIM4_Pos                    (2)
#define  RCC_APB1RSTR_TIM4_Msk                    (0x1U << RCC_APB1RSTR_TIM4_Pos)                   /*!<TIM4 Reset*/
#define  RCC_APB1RSTR_TIM4                        RCC_APB1RSTR_TIM4_Msk
#define  RCC_APB1RSTR_LPTIM3_Pos                  (4)
#define  RCC_APB1RSTR_LPTIM3_Msk                  (0x1U << RCC_APB1RSTR_LPTIM3_Pos)                 /*!<LPTIM3 Reset*/
#define  RCC_APB1RSTR_LPTIM3                      RCC_APB1RSTR_LPTIM3_Msk
#define  RCC_APB1RSTR_LPTIM4_Pos                  (5)
#define  RCC_APB1RSTR_LPTIM4_Msk                  (0x1U << RCC_APB1RSTR_LPTIM4_Pos)                 /*!<LPTIM4 Reset*/
#define  RCC_APB1RSTR_LPTIM4                      RCC_APB1RSTR_LPTIM4_Msk
#define  RCC_APB1RSTR_IRM_Pos                     (10)
#define  RCC_APB1RSTR_IRM_Msk                     (0x1U << RCC_APB1RSTR_IRM_Pos)                    /*!<Infrared Modulator Reset*/
#define  RCC_APB1RSTR_IRM                         RCC_APB1RSTR_IRM_Msk
#define  RCC_APB1RSTR_UART2_Pos                   (17)
#define  RCC_APB1RSTR_UART2_Msk                   (0x1U << RCC_APB1RSTR_UART2_Pos)                  /*!<UART2 Reset*/
#define  RCC_APB1RSTR_UART2                       RCC_APB1RSTR_UART2_Msk
#define  RCC_APB1RSTR_LPUART3_Pos                 (18)
#define  RCC_APB1RSTR_LPUART3_Msk                 (0x1U << RCC_APB1RSTR_LPUART3_Pos)                /*!<LPUART3 Reset*/
#define  RCC_APB1RSTR_LPUART3                     RCC_APB1RSTR_LPUART3_Msk
#define  RCC_APB1RSTR_LPUART4_Pos                 (19)
#define  RCC_APB1RSTR_LPUART4_Msk                 (0x1U << RCC_APB1RSTR_LPUART4_Pos)                /*!<LPUART4 Reset*/
#define  RCC_APB1RSTR_LPUART4                     RCC_APB1RSTR_LPUART4_Msk
#define  RCC_APB1RSTR_LPUART5_Pos                 (20)
#define  RCC_APB1RSTR_LPUART5_Msk                 (0x1U << RCC_APB1RSTR_LPUART5_Pos)                /*!<LPUART5 Reset*/
#define  RCC_APB1RSTR_LPUART5                     RCC_APB1RSTR_LPUART5_Msk
#define  RCC_APB1RSTR_I2C1_Pos                    (21)
#define  RCC_APB1RSTR_I2C1_Msk                    (0x1U << RCC_APB1RSTR_I2C1_Pos)                   /*!<2C1 Reset*/
#define  RCC_APB1RSTR_I2C1                        RCC_APB1RSTR_I2C1_Msk
#define  RCC_APB1RSTR_PWR_Pos                     (28)
#define  RCC_APB1RSTR_PWR_Msk                     (0x1U << RCC_APB1RSTR_PWR_Pos)                    /*!<Power Interface Reset*/
#define  RCC_APB1RSTR_PWR                         RCC_APB1RSTR_PWR_Msk

