SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_rcc.h
/**
  * @brief RCC_AHBENR Register Bit Definition
  */
#define  RCC_AHBENR_DMA_Pos                       (0)
#define  RCC_AHBENR_DMA_Msk                       (0x1U << RCC_AHBENR_DMA_Pos)                      /*!<DMA clock enable*/
#define  RCC_AHBENR_DMA                           RCC_AHBENR_DMA_Msk
#define  RCC_AHBENR_SRAM_Pos                      (2)
#define  RCC_AHBENR_SRAM_Msk                      (0x1U << RCC_AHBENR_SRAM_Pos)                     /*!<SRAM Clock Enable*/
#define  RCC_AHBENR_SRAM                          RCC_AHBENR_SRAM_Msk
#define  RCC_AHBENR_FLASH_Pos                     (4)
#define  RCC_AHBENR_FLASH_Msk                     (0x1U << RCC_AHBENR_FLASH_Pos)                    /*!<FLASH clock enable*/
#define  RCC_AHBENR_FLASH                         RCC_AHBENR_FLASH_Msk
#define  RCC_AHBENR_CRC_Pos                       (6)
#define  RCC_AHBENR_CRC_Msk                       (0x1U << RCC_AHBENR_CRC_Pos)                      /*!<CRC Clock Enable*/
#define  RCC_AHBENR_CRC                           RCC_AHBENR_CRC_Msk
#define  RCC_AHBENR_GPIOA_Pos                     (17)
#define  RCC_AHBENR_GPIOA_Msk                     (0x1U << RCC_AHBENR_GPIOA_Pos)                    /*!<GPIOA Clock Enable*/
#define  RCC_AHBENR_GPIOA                         RCC_AHBENR_GPIOA_Msk
#define  RCC_AHBENR_GPIOB_Pos                     (18)
#define  RCC_AHBENR_GPIOB_Msk                     (0x1U << RCC_AHBENR_GPIOB_Pos)                    /*!<GPIOB Clock Enable*/
#define  RCC_AHBENR_GPIOB                         RCC_AHBENR_GPIOB_Msk
#define  RCC_AHBENR_GPIOC_Pos                     (19)
#define  RCC_AHBENR_GPIOC_Msk                     (0x1U << RCC_AHBENR_GPIOC_Pos)                    /*!<GPIOC Clock Enable*/
#define  RCC_AHBENR_GPIOC                         RCC_AHBENR_GPIOC_Msk
#define  RCC_AHBENR_GPIOD_Pos                     (20)
#define  RCC_AHBENR_GPIOD_Msk                     (0x1U << RCC_AHBENR_GPIOD_Pos)                    /*!<GPIOD Clock Enable*/
#define  RCC_AHBENR_GPIOD                         RCC_AHBENR_GPIOD_Msk
#define  RCC_AHBENR_GPIOE_Pos                     (21)
#define  RCC_AHBENR_GPIOE_Msk                     (0x1U << RCC_AHBENR_GPIOE_Pos)                    /*!<GPIOE Clock Enable*/
#define  RCC_AHBENR_GPIOE                         RCC_AHBENR_GPIOE_Msk
#define  RCC_AHBENR_GPIOH_Pos                     (24)
#define  RCC_AHBENR_GPIOH_Msk                     (0x1U << RCC_AHBENR_GPIOH_Pos)                    /*!<GPIOH Clock Enable*/
#define  RCC_AHBENR_GPIOH                         RCC_AHBENR_GPIOH_Msk

/**
  * @brief RCC_APB2ENR Register Bit Definition
  */
#define  RCC_APB2ENR_SYSCFG_Pos                   (0)
#define  RCC_APB2ENR_SYSCFG_Msk                   (0x1U << RCC_APB2ENR_SYSCFG_Pos)                  /*!<SYSCFG Clock Enable*/
#define  RCC_APB2ENR_SYSCFG                       RCC_APB2ENR_SYSCFG_Msk
#define  RCC_APB2ENR_AES_Pos                      (1)
#define  RCC_APB2ENR_AES_Msk                      (0x1U << RCC_APB2ENR_AES_Pos)                     /*!<AESEN Clock Enable*/
#define  RCC_APB2ENR_AES                          RCC_APB2ENR_AES_Msk
#define  RCC_APB2ENR_TRNG_Pos                     (2)
#define  RCC_APB2ENR_TRNG_Msk                     (0x1U << RCC_APB2ENR_TRNG_Pos)                    /*!<TRNGEN Clock Enable*/
#define  RCC_APB2ENR_TRNG                         RCC_APB2ENR_TRNG_Msk
#define  RCC_APB2ENR_ADC_Pos                      (9)
#define  RCC_APB2ENR_ADC_Msk                      (0x1U << RCC_APB2ENR_ADC_Pos)                     /*!<ADC Clock Enable*/
#define  RCC_APB2ENR_ADC                          RCC_APB2ENR_ADC_Msk
#define  RCC_APB2ENR_SPI1_Pos                     (12)
#define  RCC_APB2ENR_SPI1_Msk                     (0x1U << RCC_APB2ENR_SPI1_Pos)                    /*!<SPI1 Clock Enable*/
#define  RCC_APB2ENR_SPI1                         RCC_APB2ENR_SPI1_Msk
#define  RCC_APB2ENR_USART1_Pos                   (14)
#define  RCC_APB2ENR_USART1_Msk                   (0x1U << RCC_APB2ENR_USART1_Pos)                  /*!<USART1 Clock Enable*/
#define  RCC_APB2ENR_USART1                       RCC_APB2ENR_USART1_Msk
#define  RCC_APB2ENR_COMP_Pos                     (15)
#define  RCC_APB2ENR_COMP_Msk                     (0x1U << RCC_APB2ENR_COMP_Pos)                    /*!<Comparator Clock Enable*/
#define  RCC_APB2ENR_COMP                         RCC_APB2ENR_COMP_Msk
#define  RCC_APB2ENR_TIM16_Pos                    (17)
#define  RCC_APB2ENR_TIM16_Msk                    (0x1U << RCC_APB2ENR_TIM16_Pos)                   /*!<TIM16 Clock Enable*/
#define  RCC_APB2ENR_TIM16                        RCC_APB2ENR_TIM16_Msk
#define  RCC_APB2ENR_TIM17_Pos                    (18)
#define  RCC_APB2ENR_TIM17_Msk                    (0x1U << RCC_APB2ENR_TIM17_Pos)                   /*!<TIM17 Clock Enable*/
#define  RCC_APB2ENR_TIM17                        RCC_APB2ENR_TIM17_Msk
#define  RCC_APB2ENR_LPTIM2_Pos                   (19)
#define  RCC_APB2ENR_LPTIM2_Msk                   (0x1U << RCC_APB2ENR_LPTIM2_Pos)                  /*!<LPTIM2 Clock Enable*/
#define  RCC_APB2ENR_LPTIM2                       RCC_APB2ENR_LPTIM2_Msk
#define  RCC_APB2ENR_DBG_Pos                      (22)
#define  RCC_APB2ENR_DBG_Msk                      (0x1U << RCC_APB2ENR_DBG_Pos)                     /*!<DBG Clock Enable*/
#define  RCC_APB2ENR_DBG                          RCC_APB2ENR_DBG_Msk
#define  RCC_APB2ENR_LPUART2_Pos                  (23)
#define  RCC_APB2ENR_LPUART2_Msk                  (0x1U << RCC_APB2ENR_LPUART2_Pos)                 /*!<LPUART2 Clock Enable*/
#define  RCC_APB2ENR_LPUART2                      RCC_APB2ENR_LPUART2_Msk
#define  RCC_APB2ENR_EXTI_Pos                     (29)
#define  RCC_APB2ENR_EXTI_Msk                     (0x1U << RCC_APB2ENR_EXTI_Pos)                    /*!<EXTI Clock Enable*/
#define  RCC_APB2ENR_EXTI                         RCC_APB2ENR_EXTI_Msk
#define  RCC_APB2ENR_LPTIM1_Pos                   (30)
#define  RCC_APB2ENR_LPTIM1_Msk                   (0x1U << RCC_APB2ENR_LPTIM1_Pos)                  /*!<LPTIM1 Clock Enable*/
#define  RCC_APB2ENR_LPTIM1                       RCC_APB2ENR_LPTIM1_Msk
#define  RCC_APB2ENR_LPUART1_Pos                  (31)
#define  RCC_APB2ENR_LPUART1_Msk                  (0x1U << RCC_APB2ENR_LPUART1_Pos)                 /*!<LPUART1 Clock Enable*/
#define  RCC_APB2ENR_LPUART1                      RCC_APB2ENR_LPUART1_Msk

/**
  * @brief RCC_APB1ENR Register Bit Definition
  */
#define  RCC_APB1ENR_TIM3_Pos                     (1)
#define  RCC_APB1ENR_TIM3_Msk                     (0x1U << RCC_APB1ENR_TIM3_Pos)                    /*!<TIM3 Clock Enable*/
#define  RCC_APB1ENR_TIM3                         RCC_APB1ENR_TIM3_Msk
#define  RCC_APB1ENR_TIM4_Pos                     (2)
#define  RCC_APB1ENR_TIM4_Msk                     (0x1U << RCC_APB1ENR_TIM4_Pos)                    /*!<TIM4 Clock Enable*/
#define  RCC_APB1ENR_TIM4                         RCC_APB1ENR_TIM4_Msk
#define  RCC_APB1ENR_LPTIM3_Pos                   (4)
#define  RCC_APB1ENR_LPTIM3_Msk                   (0x1U << RCC_APB1ENR_LPTIM3_Pos)                  /*!<LPTIM3 Clock Enable*/
#define  RCC_APB1ENR_LPTIM3                       RCC_APB1ENR_LPTIM3_Msk
#define  RCC_APB1ENR_LPTIM4_Pos                   (5)
#define  RCC_APB1ENR_LPTIM4_Msk                   (0x1U << RCC_APB1ENR_LPTIM4_Pos)                  /*!<LPTIM4 Clock Enable*/
#define  RCC_APB1ENR_LPTIM4                       RCC_APB1ENR_LPTIM4_Msk
#define  RCC_APB1ENR_IRM_Pos                      (10)
#define  RCC_APB1ENR_IRM_Msk                      (0x1U << RCC_APB1ENR_IRM_Pos)                     /*!<Infrared Module Clock Enable*/
#define  RCC_APB1ENR_IRM                          RCC_APB1ENR_IRM_Msk
#define  RCC_APB1ENR_USART2_Pos                   (17)
#define  RCC_APB1ENR_USART2_Msk                   (0x1U << RCC_APB1ENR_USART2_Pos)                  /*!<USART2 Clock Enable*/
#define  RCC_APB1ENR_USART2                       RCC_APB1ENR_USART2_Msk
#define  RCC_APB1ENR_LPUART3_Pos                  (18)
#define  RCC_APB1ENR_LPUART3_Msk                  (0x1U << RCC_APB1ENR_LPUART3_Pos)                 /*!<LPUART3 Clock Enable*/
#define  RCC_APB1ENR_LPUART3                      RCC_APB1ENR_LPUART3_Msk
#define  RCC_APB1ENR_LPUART4_Pos                  (19)
#define  RCC_APB1ENR_LPUART4_Msk                  (0x1U << RCC_APB1ENR_LPUART4_Pos)                 /*!<LPUART4 Clock Enable*/
#define  RCC_APB1ENR_LPUART4                      RCC_APB1ENR_LPUART4_Msk
#define  RCC_APB1ENR_LPUART5_Pos                  (20)
#define  RCC_APB1ENR_LPUART5_Msk                  (0x1U << RCC_APB1ENR_LPUART5_Pos)                 /*!<LPUART5 Clock Enable*/
#define  RCC_APB1ENR_LPUART5                      RCC_APB1ENR_LPUART5_Msk
#define  RCC_APB1ENR_I2C1_Pos                     (21)
#define  RCC_APB1ENR_I2C1_Msk                     (0x1U << RCC_APB1ENR_I2C1_Pos)                    /*!<I2C1 Clock Enable*/
#define  RCC_APB1ENR_I2C1                         RCC_APB1ENR_I2C1_Msk
#define  RCC_APB1ENR_BKP_Pos                      (24)
#define  RCC_APB1ENR_BKP_Msk                      (0x1U << RCC_APB1ENR_BKP_Pos)                     /*!<BKP Clock Enable*/
#define  RCC_APB1ENR_BKP                          RCC_APB1ENR_BKP_Msk
#define  RCC_APB1ENR_PWR_Pos                      (28)
#define  RCC_APB1ENR_PWR_Msk                      (0x1U << RCC_APB1ENR_PWR_Pos)                     /*!<Power Clock Enable*/
#define  RCC_APB1ENR_PWR                          RCC_APB1ENR_PWR_Msk
#define  RCC_APB1ENR_LCD_Pos                      (29)
#define  RCC_APB1ENR_LCD_Msk                      (0x1U << RCC_APB1ENR_LCD_Pos)                     /*!<LCD Clock Enable*/
#define  RCC_APB1ENR_LCD                          RCC_APB1ENR_LCD_Msk
#define  RCC_APB1ENR_IWDG_Pos                     (30)
#define  RCC_APB1ENR_IWDG_Msk                     (0x1U << RCC_APB1ENR_IWDG_Pos)                    /*!<IWDG Clock Enable*/
#define  RCC_APB1ENR_IWDG                         RCC_APB1ENR_IWDG_Msk
#define  RCC_APB1ENR_RTC_Pos                      (31)
#define  RCC_APB1ENR_RTC_Msk                      (0x1U << RCC_APB1ENR_RTC_Pos)                     /*!<RTC Clock Enable*/
#define  RCC_APB1ENR_RTC                          RCC_APB1ENR_RTC_Msk

/**
  * @brief RCC_BDCR Register Bit Definition
  */
#define  RCC_BDCR_LSEON_Pos                       (0)
#define  RCC_BDCR_LSEON_Msk                       (0x1U << RCC_BDCR_LSEON_Pos)                      /*!<External Low-speed Oscillator Enable*/
#define  RCC_BDCR_LSEON                           RCC_BDCR_LSEON_Msk
#define  RCC_BDCR_LSERDY_Pos                      (1)
#define  RCC_BDCR_LSERDY_Msk                      (0x1U << RCC_BDCR_LSERDY_Pos)                     /*!<External Low-speed Oscillator Ready*/
#define  RCC_BDCR_LSERDY                          RCC_BDCR_LSERDY_Msk
#define  RCC_BDCR_LSEBYP_Pos                      (2)
#define  RCC_BDCR_LSEBYP_Msk                      (0x1U << RCC_BDCR_LSEBYP_Pos)                     /*!<External Low-speed Oscillator Bypass*/
#define  RCC_BDCR_LSEBYP                          RCC_BDCR_LSEBYP_Msk
#define  RCC_BDCR_LCDSEL_Pos                      (6)
#define  RCC_BDCR_LCDSEL_Msk                      (0x3U << RCC_BDCR_LCDSEL_Pos)                     /*!<LCD clock source selection*/
#define  RCC_BDCR_LCDSEL                          RCC_BDCR_LCDSEL_Msk
#define  RCC_BDCR_LCDSEL_0                        (0x1U << RCC_BDCR_LCDSEL_Pos) 
#define  RCC_BDCR_LCDSEL_1                        (0x2U << RCC_BDCR_LCDSEL_Pos) 
#define  RCC_BDCR_RTCSEL_Pos                      (8)
#define  RCC_BDCR_RTCSEL_Msk                      (0x3U << RCC_BDCR_RTCSEL_Pos)                     /*!<RTC Clock Source Selection*/
#define  RCC_BDCR_RTCSEL                          RCC_BDCR_RTCSEL_Msk
#define  RCC_BDCR_RTCSEL_0                        (0x1U << RCC_BDCR_RTCSEL_Pos) 
#define  RCC_BDCR_RTCSEL_1                        (0x2U << RCC_BDCR_RTCSEL_Pos) 
#define  RCC_BDCR_RTCEN_Pos                       (15)
#define  RCC_BDCR_RTCEN_Msk                       (0x1U << RCC_BDCR_RTCEN_Pos)                      /*!<RTC Clock Enable*/
#define  RCC_BDCR_RTCEN                           RCC_BDCR_RTCEN_Msk
#define  RCC_BDCR_RTCRST_Pos                      (16)
#define  RCC_BDCR_RTCRST_Msk                      (0x1U << RCC_BDCR_RTCRST_Pos)                     /*!<RTC/BKP software reset*/
#define  RCC_BDCR_RTCRST                          RCC_BDCR_RTCRST_Msk
#define  RCC_BDCR_LCDRST_Pos                      (17)
#define  RCC_BDCR_LCDRST_Msk                      (0x1U << RCC_BDCR_LCDRST_Pos)                     /*!<LCD software reset*/
#define  RCC_BDCR_LCDRST                          RCC_BDCR_LCDRST_Msk
#define  RCC_BDCR_DBP_Pos                         (24)
#define  RCC_BDCR_DBP_Msk                         (0x1U << RCC_BDCR_DBP_Pos)                        /*!<Remove write protection from the backup domain. After reset, the backup register is protected against accidental writing. This bit is set to allow being written to these registers.*/
#define  RCC_BDCR_DBP                             RCC_BDCR_DBP_Msk

/**
  * @brief RCC_CSR Register Bit Definition
  */
#define  RCC_CSR_LSION_Pos                        (0)
#define  RCC_CSR_LSION_Msk                        (0x1U << RCC_CSR_LSION_Pos)                       /*!<Internal Low-speed Oscillator Enable*/
#define  RCC_CSR_LSION                            RCC_CSR_LSION_Msk
#define  RCC_CSR_LSIRDY_Pos                       (1)
#define  RCC_CSR_LSIRDY_Msk                       (0x1U << RCC_CSR_LSIRDY_Pos)                      /*!<Internal Low-speed Oscillator Ready*/
#define  RCC_CSR_LSIRDY                           RCC_CSR_LSIRDY_Msk
#define  RCC_CSR_LSISEL_Pos                       (2)
#define  RCC_CSR_LSISEL_Msk                       (0x3U << RCC_CSR_LSISEL_Pos)                      /*!<LSI Clock Frequency Select Bit*/
#define  RCC_CSR_LSISEL                           RCC_CSR_LSISEL_Msk
#define  RCC_CSR_LSISEL_0                         (0x1U << RCC_CSR_LSISEL_Pos) 
#define  RCC_CSR_LSISEL_1                         (0x2U << RCC_CSR_LSISEL_Pos) 
#define  RCC_CSR_LSCLKSEL_Pos                     (4)
#define  RCC_CSR_LSCLKSEL_Msk                     (0x1U << RCC_CSR_LSCLKSEL_Pos)                    /*!<LSCLK Clock Source Select Bit*/
#define  RCC_CSR_LSCLKSEL                         RCC_CSR_LSCLKSEL_Msk
#define  RCC_CSR_LSI_OEN_LV_Pos                   (5)
#define  RCC_CSR_LSI_OEN_LV_Msk                   (0x1U << RCC_CSR_LSI_OEN_LV_Pos)                  /*!<LSI output enable lower voltage*/
#define  RCC_CSR_LSI_OEN_LV                       RCC_CSR_LSI_OEN_LV_Msk
#define  RCC_CSR_PVDRSTEN_Pos                     (6)
#define  RCC_CSR_PVDRSTEN_Msk                     (0x1U << RCC_CSR_PVDRSTEN_Pos)                    /*!<PVD Reset Enable*/
#define  RCC_CSR_PVDRSTEN                         RCC_CSR_PVDRSTEN_Msk
#define  RCC_CSR_LOCKUPEN_Pos                     (7)
#define  RCC_CSR_LOCKUPEN_Msk                     (0x1U << RCC_CSR_LOCKUPEN_Pos)                    /*!<CPU Lockup Reset Enable*/
#define  RCC_CSR_LOCKUPEN                         RCC_CSR_LOCKUPEN_Msk
#define  RCC_CSR_PVDRSTF_Pos                      (22)
#define  RCC_CSR_PVDRSTF_Msk                      (0x1U << RCC_CSR_PVDRSTF_Pos)                     /*!<PVD Reset Flag*/
#define  RCC_CSR_PVDRSTF                          RCC_CSR_PVDRSTF_Msk
#define  RCC_CSR_LOCKUPF_Pos                      (23)
#define  RCC_CSR_LOCKUPF_Msk                      (0x1U << RCC_CSR_LOCKUPF_Pos)                     /*!<CPU Lockup Reset Flag*/
#define  RCC_CSR_LOCKUPF                          RCC_CSR_LOCKUPF_Msk
#define  RCC_CSR_RMVF_Pos                         (24)
#define  RCC_CSR_RMVF_Msk                         (0x1U << RCC_CSR_RMVF_Pos)                        /*!<Remove Reset Flag*/
#define  RCC_CSR_RMVF                             RCC_CSR_RMVF_Msk
#define  RCC_CSR_PINRSTF_Pos                      (26)
#define  RCC_CSR_PINRSTF_Msk                      (0x1U << RCC_CSR_PINRSTF_Pos)                     /*!<PIN Reset Flag*/
#define  RCC_CSR_PINRSTF                          RCC_CSR_PINRSTF_Msk
#define  RCC_CSR_PORRSTF_Pos                      (27)
#define  RCC_CSR_PORRSTF_Msk                      (0x1U << RCC_CSR_PORRSTF_Pos)                     /*!<POR/PDR Reset Flag*/
#define  RCC_CSR_PORRSTF                          RCC_CSR_PORRSTF_Msk
#define  RCC_CSR_SFTRSTF_Pos                      (28)
#define  RCC_CSR_SFTRSTF_Msk                      (0x1U << RCC_CSR_SFTRSTF_Pos)                     /*!<Software Reset Flag*/
#define  RCC_CSR_SFTRSTF                          RCC_CSR_SFTRSTF_Msk
#define  RCC_CSR_IWDGRSTF_Pos                     (29)
#define  RCC_CSR_IWDGRSTF_Msk                     (0x1U << RCC_CSR_IWDGRSTF_Pos)                    /*!<Independent Watchdog Reset Flag*/
#define  RCC_CSR_IWDGRSTF                         RCC_CSR_IWDGRSTF_Msk
#define  RCC_CSR_LPWRRSTF_Pos                     (31)
#define  RCC_CSR_LPWRRSTF_Msk                     (0x1U << RCC_CSR_LPWRRSTF_Pos)                    /*!<Low Power Reset Flag*/
#define  RCC_CSR_LPWRRSTF                         RCC_CSR_LPWRRSTF_Msk

/**
  * @brief RCC_AHBRSTR Register Bit Definition
  */
#define  RCC_AHBRSTR_DMA_Pos                      (0)
#define  RCC_AHBRSTR_DMA_Msk                      (0x1U << RCC_AHBRSTR_DMA_Pos)                     /*!<DMA Reset*/
#define  RCC_AHBRSTR_DMA                          RCC_AHBRSTR_DMA_Msk
#define  RCC_AHBRSTR_CRC_Pos                      (6)
#define  RCC_AHBRSTR_CRC_Msk                      (0x1U << RCC_AHBRSTR_CRC_Pos)                     /*!<CRC Reset*/
#define  RCC_AHBRSTR_CRC                          RCC_AHBRSTR_CRC_Msk
#define  RCC_AHBRSTR_GPIOA_Pos                    (17)
#define  RCC_AHBRSTR_GPIOA_Msk                    (0x1U << RCC_AHBRSTR_GPIOA_Pos)                   /*!<GPIOA Reset*/
#define  RCC_AHBRSTR_GPIOA                        RCC_AHBRSTR_GPIOA_Msk
#define  RCC_AHBRSTR_GPIOB_Pos                    (18)
#define  RCC_AHBRSTR_GPIOB_Msk                    (0x1U << RCC_AHBRSTR_GPIOB_Pos)                   /*!<GPIOB Reset*/
#define  RCC_AHBRSTR_GPIOB                        RCC_AHBRSTR_GPIOB_Msk
#define  RCC_AHBRSTR_GPIOC_Pos                    (19)
#define  RCC_AHBRSTR_GPIOC_Msk                    (0x1U << RCC_AHBRSTR_GPIOC_Pos)                   /*!<GPIOC Reset*/
#define  RCC_AHBRSTR_GPIOC                        RCC_AHBRSTR_GPIOC_Msk
#define  RCC_AHBRSTR_GPIOD_Pos                    (20)
#define  RCC_AHBRSTR_GPIOD_Msk                    (0x1U << RCC_AHBRSTR_GPIOD_Pos)                   /*!<GPIOD Reset*/
#define  RCC_AHBRSTR_GPIOD                        RCC_AHBRSTR_GPIOD_Msk
#define  RCC_AHBRSTR_GPIOE_Pos                    (21)
#define  RCC_AHBRSTR_GPIOE_Msk                    (0x1U << RCC_AHBRSTR_GPIOE_Pos)                   /*!<GPIOE Reset*/
#define  RCC_AHBRSTR_GPIOE                        RCC_AHBRSTR_GPIOE_Msk
#define  RCC_AHBRSTR_GPIOH_Pos                    (24)
#define  RCC_AHBRSTR_GPIOH_Msk                    (0x1U << RCC_AHBRSTR_GPIOH_Pos)                   /*!<GPIOH Reset*/
#define  RCC_AHBRSTR_GPIOH                        RCC_AHBRSTR_GPIOH_Msk

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define  RCC_CFGR2_LPUART1CLKSEL_Pos              (0)
#define  RCC_CFGR2_LPUART1CLKSEL_Msk              (0x3U << RCC_CFGR2_LPUART1CLKSEL_Pos)             /*!<LPUART1 clock source selection*/
#define  RCC_CFGR2_LPUART1CLKSEL                  RCC_CFGR2_LPUART1CLKSEL_Msk
#define  RCC_CFGR2_LPUART1CLKSEL_0                (0x1U << RCC_CFGR2_LPUART1CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART1CLKSEL_1                (0x2U << RCC_CFGR2_LPUART1CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART2CLKSEL_Pos              (2)
#define  RCC_CFGR2_LPUART2CLKSEL_Msk              (0x3U << RCC_CFGR2_LPUART2CLKSEL_Pos)             /*!<LPUART2 clock source selection*/
#define  RCC_CFGR2_LPUART2CLKSEL                  RCC_CFGR2_LPUART2CLKSEL_Msk
#define  RCC_CFGR2_LPUART2CLKSEL_0                (0x1U << RCC_CFGR2_LPUART2CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART2CLKSEL_1                (0x2U << RCC_CFGR2_LPUART2CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART3CLKSEL_Pos              (4)
#define  RCC_CFGR2_LPUART3CLKSEL_Msk              (0x3U << RCC_CFGR2_LPUART3CLKSEL_Pos)             /*!<LPUART3 clock source selection*/
#define  RCC_CFGR2_LPUART3CLKSEL                  RCC_CFGR2_LPUART3CLKSEL_Msk
#define  RCC_CFGR2_LPUART3CLKSEL_0                (0x1U << RCC_CFGR2_LPUART3CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART3CLKSEL_1                (0x2U << RCC_CFGR2_LPUART3CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART4CLKSEL_Pos              (6)
#define  RCC_CFGR2_LPUART4CLKSEL_Msk              (0x3U << RCC_CFGR2_LPUART4CLKSEL_Pos)             /*!<LPUART4 clock source selection*/
#define  RCC_CFGR2_LPUART4CLKSEL                  RCC_CFGR2_LPUART4CLKSEL_Msk
#define  RCC_CFGR2_LPUART4CLKSEL_0                (0x1U << RCC_CFGR2_LPUART4CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART4CLKSEL_1                (0x2U << RCC_CFGR2_LPUART4CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART5CLKSEL_Pos              (8)
#define  RCC_CFGR2_LPUART5CLKSEL_Msk              (0x3U << RCC_CFGR2_LPUART5CLKSEL_Pos)             /*!<LPUART5 clock source selection*/
#define  RCC_CFGR2_LPUART5CLKSEL                  RCC_CFGR2_LPUART5CLKSEL_Msk
#define  RCC_CFGR2_LPUART5CLKSEL_0                (0x1U << RCC_CFGR2_LPUART5CLKSEL_Pos) 
#define  RCC_CFGR2_LPUART5CLKSEL_1                (0x2U << RCC_CFGR2_LPUART5CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM1CLKSEL_Pos               (12)
#define  RCC_CFGR2_LPTIM1CLKSEL_Msk               (0x3U << RCC_CFGR2_LPTIM1CLKSEL_Pos)              /*!<LPTIM1 clock source selection*/
#define  RCC_CFGR2_LPTIM1CLKSEL                   RCC_CFGR2_LPTIM1CLKSEL_Msk
#define  RCC_CFGR2_LPTIM1CLKSEL_0                 (0x1U << RCC_CFGR2_LPTIM1CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM1CLKSEL_1                 (0x2U << RCC_CFGR2_LPTIM1CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM2CLKSEL_Pos               (14)
#define  RCC_CFGR2_LPTIM2CLKSEL_Msk               (0x3U << RCC_CFGR2_LPTIM2CLKSEL_Pos)              /*!<LPTIM2 clock source selection*/
#define  RCC_CFGR2_LPTIM2CLKSEL                   RCC_CFGR2_LPTIM2CLKSEL_Msk
#define  RCC_CFGR2_LPTIM2CLKSEL_0                 (0x1U << RCC_CFGR2_LPTIM2CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM2CLKSEL_1                 (0x2U << RCC_CFGR2_LPTIM2CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM3CLKSEL_Pos               (16)
#define  RCC_CFGR2_LPTIM3CLKSEL_Msk               (0x3U << RCC_CFGR2_LPTIM3CLKSEL_Pos)              /*!<LPTIM3 clock source selection*/
#define  RCC_CFGR2_LPTIM3CLKSEL                   RCC_CFGR2_LPTIM3CLKSEL_Msk
#define  RCC_CFGR2_LPTIM3CLKSEL_0                 (0x1U << RCC_CFGR2_LPTIM3CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM3CLKSEL_1                 (0x2U << RCC_CFGR2_LPTIM3CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM4CLKSEL_Pos               (18)
#define  RCC_CFGR2_LPTIM4CLKSEL_Msk               (0x3U << RCC_CFGR2_LPTIM4CLKSEL_Pos)              /*!<LPTIM4 clock source selection*/
#define  RCC_CFGR2_LPTIM4CLKSEL                   RCC_CFGR2_LPTIM4CLKSEL_Msk
#define  RCC_CFGR2_LPTIM4CLKSEL_0                 (0x1U << RCC_CFGR2_LPTIM4CLKSEL_Pos) 
#define  RCC_CFGR2_LPTIM4CLKSEL_1                 (0x2U << RCC_CFGR2_LPTIM4CLKSEL_Pos) 
#define  RCC_CFGR2_MCOPRE_Pos                     (20)
#define  RCC_CFGR2_MCOPRE_Msk                     (0xFU << RCC_CFGR2_MCOPRE_Pos)                    /*!<MCOPRE: MCO Clock Prescaler Factor*/
#define  RCC_CFGR2_MCOPRE                         RCC_CFGR2_MCOPRE_Msk
#define  RCC_CFGR2_MCOPRE_0                       (0x1U << RCC_CFGR2_MCOPRE_Pos) 
#define  RCC_CFGR2_MCOPRE_1                       (0x2U << RCC_CFGR2_MCOPRE_Pos) 
#define  RCC_CFGR2_MCOPRE_2                       (0x4U << RCC_CFGR2_MCOPRE_Pos) 
#define  RCC_CFGR2_MCOPRE_3                       (0x8U << RCC_CFGR2_MCOPRE_Pos) 

