SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_rcc.h
/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define  RCC_SYSCFG_PROGCHECKEN_Pos               (0)
#define  RCC_SYSCFG_PROGCHECKEN_Msk               (0x1U << RCC_SYSCFG_PROGCHECKEN_Pos)              /*!<Check whether the data in Flash is 0xFF when writing Flash*/
#define  RCC_SYSCFG_PROGCHECKEN                   RCC_SYSCFG_PROGCHECKEN_Msk
#define  RCC_SYSCFG_SECTOR1KCFG_Pos               (1)
#define  RCC_SYSCFG_SECTOR1KCFG_Msk               (0x1U << RCC_SYSCFG_SECTOR1KCFG_Pos)              /*!<The size of the erase when the Flash page is erased.*/
#define  RCC_SYSCFG_SECTOR1KCFG                   RCC_SYSCFG_SECTOR1KCFG_Msk

/**
  * @brief RCC_HSIDLY Register Bit Definition
  */
#define  RCC_HSIDLY_HSIDLY_Pos                    (0)
#define  RCC_HSIDLY_HSIDLY_Msk                    (0xFFFU << RCC_HSIDLY_HSIDLY_Pos)                 /*!<HSI delay time*/
#define  RCC_HSIDLY_HSIDLY                        RCC_HSIDLY_HSIDLY_Msk
#define  RCC_HSIDLY_HSIDLY_0                      (0x001U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_1                      (0x002U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_2                      (0x004U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_3                      (0x008U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_4                      (0x010U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_5                      (0x020U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_6                      (0x040U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_7                      (0x080U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_8                      (0x100U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_9                      (0x200U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_10                     (0x400U << RCC_HSIDLY_HSIDLY_Pos) 
#define  RCC_HSIDLY_HSIDLY_11                     (0x800U << RCC_HSIDLY_HSIDLY_Pos) 

/**
  * @brief RCC_HSEDLY Register Bit Definition
  */
#define  RCC_HSEDLY_HSEDLY_Pos                    (0)
#define  RCC_HSEDLY_HSEDLY_Msk                    (0xFFFFU << RCC_HSEDLY_HSEDLY_Pos)                /*!<HSE delay time*/
#define  RCC_HSEDLY_HSEDLY                        RCC_HSEDLY_HSEDLY_Msk
#define  RCC_HSEDLY_HSEDLY_0                      (0x0001U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_1                      (0x0002U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_2                      (0x0004U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_3                      (0x0008U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_4                      (0x0010U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_5                      (0x0020U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_6                      (0x0040U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_7                      (0x0080U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_8                      (0x0100U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_9                      (0x0200U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_10                     (0x0400U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_11                     (0x0800U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_12                     (0x1000U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_13                     (0x2000U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_14                     (0x4000U << RCC_HSEDLY_HSEDLY_Pos) 
#define  RCC_HSEDLY_HSEDLY_15                     (0x8000U << RCC_HSEDLY_HSEDLY_Pos) 

/**
  * @brief RCC_ICSCR Register Bit Definition
  */
#define  RCC_ICSCR_HSICALSEL_Pos                  (11)
#define  RCC_ICSCR_HSICALSEL_Msk                  (0x1FU << RCC_ICSCR_HSICALSEL_Pos)                /*!<Select an internal high-speed clock calibration value*/
#define  RCC_ICSCR_HSICALSEL                      RCC_ICSCR_HSICALSEL_Msk
#define  RCC_ICSCR_HSICALSEL_0                    (0x01U << RCC_ICSCR_HSICALSEL_Pos) 
#define  RCC_ICSCR_HSICALSEL_1                    (0x02U << RCC_ICSCR_HSICALSEL_Pos) 
#define  RCC_ICSCR_HSICALSEL_2                    (0x04U << RCC_ICSCR_HSICALSEL_Pos) 
#define  RCC_ICSCR_HSICALSEL_3                    (0x08U << RCC_ICSCR_HSICALSEL_Pos) 
#define  RCC_ICSCR_HSICALSEL_4                    (0x10U << RCC_ICSCR_HSICALSEL_Pos) 
#define  RCC_ICSCR_HSICALSFT_Pos                  (16)
#define  RCC_ICSCR_HSICALSFT_Msk                  (0x3FFU << RCC_ICSCR_HSICALSFT_Pos)               /*!<Internal high-speed clock calibration*/
#define  RCC_ICSCR_HSICALSFT                      RCC_ICSCR_HSICALSFT_Msk
#define  RCC_ICSCR_HSICALSFT_0                    (0x001U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_1                    (0x002U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_2                    (0x004U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_3                    (0x008U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_4                    (0x010U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_5                    (0x020U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_6                    (0x040U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_7                    (0x080U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_8                    (0x100U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSICALSFT_9                    (0x200U << RCC_ICSCR_HSICALSFT_Pos) 
#define  RCC_ICSCR_HSITEMPCAL_Pos                 (26)
#define  RCC_ICSCR_HSITEMPCAL_Msk                 (0xFU << RCC_ICSCR_HSITEMPCAL_Pos)                /*!<Internal high-speed clock temperature calibration*/
#define  RCC_ICSCR_HSITEMPCAL                     RCC_ICSCR_HSITEMPCAL_Msk
#define  RCC_ICSCR_HSITEMPCAL_0                   (0x1U << RCC_ICSCR_HSITEMPCAL_Pos) 
#define  RCC_ICSCR_HSITEMPCAL_1                   (0x2U << RCC_ICSCR_HSITEMPCAL_Pos) 
#define  RCC_ICSCR_HSITEMPCAL_2                   (0x4U << RCC_ICSCR_HSITEMPCAL_Pos) 
#define  RCC_ICSCR_HSITEMPCAL_3                   (0x8U << RCC_ICSCR_HSITEMPCAL_Pos) 

/**
  * @brief RCC_FRVSCR Register Bit Definition
  */
#define  RCC_FRVSCR_VREFBUFTRIMSEL_Pos            (11)
#define  RCC_FRVSCR_VREFBUFTRIMSEL_Msk            (0x1FU << RCC_FRVSCR_VREFBUFTRIMSEL_Pos)          /*!<Select a VREFBUF calibration value*/
#define  RCC_FRVSCR_VREFBUFTRIMSEL                RCC_FRVSCR_VREFBUFTRIMSEL_Msk
#define  RCC_FRVSCR_VREFBUFTRIMSEL_0              (0x01U << RCC_FRVSCR_VREFBUFTRIMSEL_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIMSEL_1              (0x02U << RCC_FRVSCR_VREFBUFTRIMSEL_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIMSEL_2              (0x04U << RCC_FRVSCR_VREFBUFTRIMSEL_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIMSEL_3              (0x08U << RCC_FRVSCR_VREFBUFTRIMSEL_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIMSEL_4              (0x10U << RCC_FRVSCR_VREFBUFTRIMSEL_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIM_Pos               (16)
#define  RCC_FRVSCR_VREFBUFTRIM_Msk               (0x1FU << RCC_FRVSCR_VREFBUFTRIM_Pos)             /*!<VREFBUF calibration value*/
#define  RCC_FRVSCR_VREFBUFTRIM                   RCC_FRVSCR_VREFBUFTRIM_Msk
#define  RCC_FRVSCR_VREFBUFTRIM_0                 (0x01U << RCC_FRVSCR_VREFBUFTRIM_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIM_1                 (0x02U << RCC_FRVSCR_VREFBUFTRIM_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIM_2                 (0x04U << RCC_FRVSCR_VREFBUFTRIM_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIM_3                 (0x08U << RCC_FRVSCR_VREFBUFTRIM_Pos) 
#define  RCC_FRVSCR_VREFBUFTRIM_4                 (0x10U << RCC_FRVSCR_VREFBUFTRIM_Pos) 

/**
  * @brief RCC_LSCCR Register Bit Definition
  */
#define  RCC_LSCCR_RTCLSC_Pos                     (0)
#define  RCC_LSCCR_RTCLSC_Msk                     (0x1U << RCC_LSCCR_RTCLSC_Pos)                    /*!<RTC Low Speed Clock Control*/
#define  RCC_LSCCR_RTCLSC                         RCC_LSCCR_RTCLSC_Msk
#define  RCC_LSCCR_IWDGLSC_Pos                    (2)
#define  RCC_LSCCR_IWDGLSC_Msk                    (0x1U << RCC_LSCCR_IWDGLSC_Pos)                   /*!<IWDG Low Speed Clock Control*/
#define  RCC_LSCCR_IWDGLSC                        RCC_LSCCR_IWDGLSC_Msk
#define  RCC_LSCCR_SLCDLSC_Pos                    (4)
#define  RCC_LSCCR_SLCDLSC_Msk                    (0x1U << RCC_LSCCR_SLCDLSC_Pos)                   /*!<SLCD Low Speed Clock Control*/
#define  RCC_LSCCR_SLCDLSC                        RCC_LSCCR_SLCDLSC_Msk

/**
  * @brief RCC_LDOCR Register Bit Definition
  */
#define  RCC_LDOCR_LDO_TRIM_SEL_Pos               (12)
#define  RCC_LDOCR_LDO_TRIM_SEL_Msk               (0xFU << RCC_LDOCR_LDO_TRIM_SEL_Pos)              /*!<LDO_TRIM Select bits*/
#define  RCC_LDOCR_LDO_TRIM_SEL                   RCC_LDOCR_LDO_TRIM_SEL_Msk
#define  RCC_LDOCR_LDO_TRIM_SEL_0                 (0x1U << RCC_LDOCR_LDO_TRIM_SEL_Pos) 
#define  RCC_LDOCR_LDO_TRIM_SEL_1                 (0x2U << RCC_LDOCR_LDO_TRIM_SEL_Pos) 
#define  RCC_LDOCR_LDO_TRIM_SEL_2                 (0x4U << RCC_LDOCR_LDO_TRIM_SEL_Pos) 
#define  RCC_LDOCR_LDO_TRIM_SEL_3                 (0x8U << RCC_LDOCR_LDO_TRIM_SEL_Pos) 
#define  RCC_LDOCR_LDO_TRIM_CAL_Pos               (16)
#define  RCC_LDOCR_LDO_TRIM_CAL_Msk               (0xFU << RCC_LDOCR_LDO_TRIM_CAL_Pos)              /*!<LDO_TRIM value*/
#define  RCC_LDOCR_LDO_TRIM_CAL                   RCC_LDOCR_LDO_TRIM_CAL_Msk
#define  RCC_LDOCR_LDO_TRIM_CAL_0                 (0x1U << RCC_LDOCR_LDO_TRIM_CAL_Pos) 
#define  RCC_LDOCR_LDO_TRIM_CAL_1                 (0x2U << RCC_LDOCR_LDO_TRIM_CAL_Pos) 
#define  RCC_LDOCR_LDO_TRIM_CAL_2                 (0x4U << RCC_LDOCR_LDO_TRIM_CAL_Pos) 
#define  RCC_LDOCR_LDO_TRIM_CAL_3                 (0x8U << RCC_LDOCR_LDO_TRIM_CAL_Pos) 

#endif

